Revit 2027 API
RebarConstraintsManager.IsRebarConstrainedPlacementEnabled Property
Note: This API is now obsolete.
 A static property defining that the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. The 'Rebar Constrained Placement' functionality was removed from Revit 2027. Similar functionality can be achieved using by setting constraints to another rebar.")]
public static bool IsRebarConstrainedPlacementEnabled { get; set; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. The 'Rebar Constrained Placement' functionality was removed from Revit 2027. Similar functionality can be achieved using by setting constraints to another rebar.")>
Public Shared Property IsRebarConstrainedPlacementEnabled As Boolean
	Get
	Set
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and may be removed in a later version of Revit. The 'Rebar Constrained Placement' functionality was removed from Revit 2027. Similar functionality can be achieved using by setting constraints to another rebar.")]
static property bool IsRebarConstrainedPlacementEnabled {
	bool get ();
	void set (bool value);
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit. The 'Rebar Constrained Placement' functionality was removed from Revit 2027. Similar functionality can be achieved using by setting constraints to another rebar.")>]
static member IsRebarConstrainedPlacementEnabled : bool with get, set
Property Value
Boolean
Remarks
The 'Rebar Constrained Placement' functionality was removed from Revit 2027. Similar functionality can be achieved using by setting constraints to another rebar.
This property will always return false.
Setting this property to true will have no effect.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace